OpenFoam/validation7rod/justfluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 0.001;

vertices
(
    (6.000000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //0
    (8.125000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //1
    (8.125000000000000000000000000000 4.690970937165708676275244215503 0.000000000000000000000000000000) //2
    (5.196152422706632023619022220373 2.999999999999999555910790149937 0.000000000000000000000000000000) //3
    (6.000000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //4
    (8.125000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //5
    (8.125000000000000000000000000000 4.690970937165708676275244215503 1000.000000000000000000000000000000) //6
    (5.196152422706632023619022220373 2.999999999999999555910790149937 1000.000000000000000000000000000000) //7
    (22.250000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //8
    (24.375000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //9
    (24.375000000000000000000000000000 4.690970937165708676275244215503 0.000000000000000000000000000000) //10
    (21.446152422706632023619022220373 2.999999999999999555910790149937 0.000000000000000000000000000000) //11
    (22.250000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //12
    (24.375000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //13
    (24.375000000000000000000000000000 4.690970937165708676275244215503 1000.000000000000000000000000000000) //14
    (21.446152422706632023619022220373 2.999999999999999555910790149937 1000.000000000000000000000000000000) //15
    (16.250000000000000000000000000000 9.381941874331417352550488431007 0.000000000000000000000000000000) //16
    (16.250000000000000000000000000000 6.000000000000000000000000000000 0.000000000000000000000000000000) //17
    (16.250000000000000000000000000000 9.381941874331417352550488431007 1000.000000000000000000000000000000) //18
    (16.250000000000000000000000000000 6.000000000000000000000000000000 1000.000000000000000000000000000000) //19
    (11.053847577293367976380977779627 2.999999999999999555910790149937 0.000000000000000000000000000000) //20
    (11.053847577293367976380977779627 2.999999999999999555910790149937 1000.000000000000000000000000000000) //21
    (10.250000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //22
    (10.250000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //23
    (26.843198238411655864865679177456 4.690970937165708676275244215503 0.000000000000000000000000000000) //24
    (27.250000000000000000000000000000 0.000000000000000000000000000000 0.000000000000000000000000000000) //25
    (26.843198238411655864865679177456 4.690970937165708676275244215503 1000.000000000000000000000000000000) //26
    (27.250000000000000000000000000000 0.000000000000000000000000000000 1000.000000000000000000000000000000) //27
    (23.599192253125956142412178451195 13.624999999999998223643160599750 0.000000000000000000000000000000) //28
    (23.599192253125956142412178451195 13.624999999999998223643160599750 1000.000000000000000000000000000000) //29
);

blocks
(
  hex ( 0 1 2 3 4 5 6 7 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 8 9 10 11 12 13 14 15 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 11 10 16 17 15 14 18 19 ) (27 12 100) simpleGrading (12 1 1)
  hex ( 17 16 2 20 19 18 6 21 ) (27 12 100) simpleGrading (12 1 1)
  hex ( 20 2 1 22 21 6 5 23 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 24 10 9 25 26 14 13 27 ) (27 6 100) simpleGrading (12 1 1)
  hex ( 28 16 10 24 29 18 14 26 ) (27 12 100) simpleGrading (12 1 1)
);

edges
(
    arc 4 7 (5.795554957734409 1.552914270615124 1000)
    arc 27 26 (27.148109068558693 2.3542884278781933 1000)
    arc 26 29 (25.61372500143396 9.300515660484482 1000)
    arc 12 15 (22.04555495773441 1.552914270615124 1000)
    arc 15 19 (19.25 5.196152422706632 1000)
    arc 19 21 (13.25 5.196152422706632 1000)
    arc 21 23 (10.45444504226559 1.552914270615124 1000)
    arc 0 3 (5.795554957734409 1.552914270615124 0)
    arc 25 24 (27.148109068558693 2.3542884278781933 0)
    arc 24 28 (25.61372500143396 9.300515660484482 0)
    arc 8 11 (22.04555495773441 1.552914270615124 0)
    arc 11 17 (19.25 5.196152422706632 0)
    arc 17 20 (13.25 5.196152422706632 0)
    arc 20 22 (10.45444504226559 1.552914270615124 0)
);

boundary
(
    Outterwall { type patch; faces ((29 26 24 28)(26 27 25 24));}
    symmetryleft { type symmetry; faces ((5 4 0 1)(23 5 1 22)(13 12 8 9)(27 13 9 25));}
    symmetryrigt { type symmetry; faces ((7 6 2 3)(6 18 16 2)(18 29 28 16));}
    Outlet { type patch; faces ((4 5 6 7)(23 21 6 5)(21 19 18 6)(19 15 14 18)(15 12 13 14)(14 26 29 18)(27 26 14 13));}
    Inlet { type patch; faces ((3 2 1 0)(1 2 20 22)(2 16 17 20)(16 10 11 17)(10 9 8 11)(10 16 28 24)(9 10 24 25));}
    fluid_to_cilcen { type patch; faces ((4 7 3 0));}
    fluid_to_ciltop { type patch; faces ((12 15 11 8)(15 19 17 11)(19 21 20 17)(21 23 22 20));}
);

mergePatchPairs
(
);
