OpenFoam/validation7rod/justfluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.001;

        smoother         DICGaussSeidel;

        cacheAgglomeration    true;
        nCellsInCoarsestLevel 10;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    }

    "(U|h)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.001;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors   0;
    consistent                 yes;

    residualControl
    {
        p_rgh           1e-6;
        Uz              1e-6;
        h               1e-6;
    }
}

relaxationFactors
{
    fields
    {
        //rho             1.0;
        //p_rgh           1;
    }
    equations
    {
        U               0.3;
        ".*"            0.9;
    }
}

// ************************************************************************* //
